Repository: CofficLab/GitOK
Catalog: Packages/PluginGitRepositorySettings/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Add
zh_hans: 添加
zh_hk: 新增

source: Add Remote Repository
zh_hans: 添加远程仓库
zh_hk: 新增遠端儲存庫

source: Add a new remote repository URL
zh_hans: 添加一个新的远程仓库 URL
zh_hk: 新增一個新的遠端儲存庫 URL

source: Add a remote repository to enable push and pull operations
zh_hans: 添加远程仓库以启用推送和拉取操作
zh_hk: 新增遠端儲存庫以啟用推送和拉取操作

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Changes take effect without restarting GitOK.
zh_hans: 改动无需重启 GitOK 即生效。
zh_hk: 改動無需重啓 GitOK 即生效。

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Current Project
zh_hans: 当前项目
zh_hk: 目前專案

source: Customize behavior for the currently open repository.
zh_hans: 为当前打开的仓库定制行为。
zh_hk: 為當前打開的倉庫定製行為。

source: Edit values
zh_hans: 编辑值
zh_hk: 編輯值

source: Edits apply to the repository's local config file.
zh_hans: 修改作用于仓库的本地配置文件。
zh_hk: 修改作用於倉庫的本地配置文件。

source: Failed to add remote repository: %@
zh_hans: 添加远程仓库失败：%@
zh_hk: 新增遠端儲存庫失敗：%@

source: Failed to delete remote repository: %@
zh_hans: 删除远程仓库失败：%@
zh_hk: 刪除遠端儲存庫失敗：%@

source: Fine-tune how GitOK treats each repository.
zh_hans: 精细调整 GitOK 对待每个仓库的方式。
zh_hk: 精細調整 GitOK 對待每個倉庫的方式。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Instant Apply
zh_hans: 即时生效
zh_hk: 即時生效

source: Local Git Config
zh_hans: 本地 Git 配置
zh_hk: 本地 Git 配置

source: Local Path
zh_hans: 本地路径
zh_hk: 本機路徑

source: Local config
zh_hans: 本地配置
zh_hk: 本地配置

source: No Remote Repository Configured
zh_hans: 未配置远程仓库
zh_hk: 未設定遠端儲存庫

source: Open settings
zh_hans: 打开设置
zh_hk: 打開設置

source: Per-Repo Options
zh_hans: 仓库级选项
zh_hk: 倉庫級選項

source: Per-project
zh_hans: 按项目
zh_hk: 按項目

source: Persist
zh_hans: 持久保存
zh_hk: 持久保存

source: Persistent
zh_hans: 持久生效
zh_hk: 持久生效

source: Please Select a Project First
zh_hans: 请先选择一个项目
zh_hk: 請先選擇一個專案

source: Project Name
zh_hans: 项目名称
zh_hk: 專案名稱

source: Remote Repository
zh_hans: 远程仓库
zh_hk: 遠端儲存庫

source: Remote name (e.g. origin)
zh_hans: 远程名称（如 origin）
zh_hk: 遠端名稱（如 origin）

source: Repository Settings
zh_hans: 仓库设置
zh_hk: 儲存庫設定

source: Repository URL
zh_hans: 仓库 URL
zh_hk: 儲存庫 URL

source: Repository settings are scoped to the active project.
zh_hans: 仓库设置作用于当前项目。
zh_hk: 倉庫設置作用於當前項目。

source: Tune repository-specific options.
zh_hans: 调整仓库专属选项。
zh_hk: 調整倉庫專屬選項。

source: Values are written to the local Git config.
zh_hans: 值写入本地 Git 配置。
zh_hk: 值寫入本地 Git 配置。

source: config scope
zh_hans: 配置作用域
zh_hk: 配置作用域

source: repo at a time
zh_hans: 一次一个仓库
zh_hk: 一次一個倉庫
